# 共用變數範例
DATA_PATH = "../data"
MOTOR_BIKE_LABELS = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 13, 14, 15, 16, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 77, 88]
CAR_TRUCK_LABELS = [0, 1, 2, 6, 7, 8, 13, 14, 16, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 77, 88]
PED_LABELS = [0, 11, 12, 31, 77, 88]

LABEL_BUTTON_TEXTS = {
    0: "None",
    1: "直行 + 對向左轉",
    2: "左轉 + 對向直行",
    3: "並行(機車加速超越)",
    4: "並行(機車等速並行)",
    5: "並行(機車減速被超)",
    6: "繞過前方車輛",
    7: "被 右側 cut-in",
    8: "被 左側 cut-in",
    9: "右轉 + 機車直行/待轉",
    10: "左轉 + 待轉機車",
    15: "左轉 + 左側機車通過",
    11: "右轉 + 行人通過",
    12: "左轉 + 行人通過",
    13: "cut-out + 右側直行",
    14: "cut-out + 左側直行",
    16: "ego 跟車",

    21: "直+L側直行(含停等)",
    22: "直+L側左轉",
    23: "直+R側直行/左轉",
    24: "直+R側右轉",
    25: "左轉+L側直行/左轉",
    26: "左轉+R側直行",
    27: "左轉+R側左轉",
    28: "右轉+L側直行",
    29: "右轉+對向左轉",
    32: "左轉+對向右轉",
    30: "會車",
    31: "直行+行人通過",
    
    77: "其他",
    88: "不確定",

    # 23 + 3 ped
}

DEBUG_MODE = False

